0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
  inlet
    {
      type fixedValue;
      value uniform (2.6640e-7 0 0);
    }
  outlet
    {
      type zeroGradient;
    }
  walls
    {
      type fixedValue;
      value uniform (0 0 0);
    }
  frontAndBack
    {
      type empty;
    }
  /*walls
  {
    type groovyBC;
    value $internalField;
    valueExpression "vector(-0.52e-9*myGrad.x/internalField(Csalt), -0.52e-9*myGrad.y/internalField(Csalt), -0.52e-9*myGrad.z/internalField(Csalt))";
    variables "myGrad=internalField(CsaltGrad);";
    }*/
}

// ************************************************************************* //
