constant/RASProperties
/*--------------------------------*- C++ -*----------------------------------*\                                   \

| =========                 |                                                 |                                   \

| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |                                   \

|  \\    /   O peration     | Version:  2.3.0                                 |                                   \

|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |                                   \

|    \\/     M anipulation  |                                                 |                                   \

\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      RASProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //                                   \


RASModel        laminar;

turbulence      off;

printCoeffs     off;


// ************************************************************************* //
