constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

transportModel  Newtonian;

nu              nu [ 0 2 -1 0 0 0 0 ] 0.9e-6;

Dsalt           Dsalt [ 0 2 -1 0 0 0 0 ] 2.0e-9;

Dpart1           Dpart1 [ 0 2 -1 0 0 0 0 ] 1.0e-12;
Dpart2           Dpart2 [ 0 2 -1 0 0 0 0 ] 1.0e-12;
Dpart3           Dpart3 [ 0 2 -1 0 0 0 0 ] 1.0e-12;
Dpart4           Dpart4 [ 0 2 -1 0 0 0 0 ] 1.0e-12;
Dpart5           Dpart5 [ 0 2 -1 0 0 0 0 ] 1.0e-12;

timeFactor      timeFactor [ 0 0 0 0 0 0 0 ] 1000;

myTol           myTol [ 0 0 0 0 0 0 0 ] 5.0e-9;

numSteps        numSteps [ 0 0 0 0 0 0 0 ] 50;

numIters        numIters [ 0 0 0 0 0 0 0 ] 2000;

minIters        minIters [ 0 0 0 0 0 0 0 ] 10;

gammap1          gammap1 [ 0 2 -1 0 0 0 0 ] 200e-12;
gammap2          gammap2 [ 0 2 -1 0 0 0 0 ] 400e-12;
gammap3          gammap3 [ 0 2 -1 0 0 0 0 ] 600e-12;
gammap4          gammap4 [ 0 2 -1 0 0 0 0 ] 800e-12;
gammap5          gammap5 [ 0 2 -1 0 0 0 0 ] 1000e-12;

// ************************************************************************* //
