system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
 (0 -25e-6 0) // 0
 (5e-3 -25e-6 0) // 1
 (5e-3 25e-6 0) // 2
 (0 25e-6 0) // 3
 (0 -25e-6 5e-6) // 4
 (5e-3 -25e-6 5e-6) // 5
 (5e-3 25e-6 5e-6) // 6
 (0 25e-6 5e-6) // 7
);

blocks
(
 hex (0 1 2 3 4 5 6 7) (10 10 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (2 6 5 1)
        );
    }
    walls
    {
        type patch;
        faces
        (
            (3 7 6 2)
	    (4 0 1 5)
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (3 2 1 0)
            (7 4 5 6)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
