system/decomposeParDict
/*--------------------------------*- C++ -*----------------------------------*\                                   \

| =========                 |                                                 |                                   \

| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |                                   \

|  \\    /   O peration     | Version:  2.2.0                                 |                                   \

|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |                                   \

|    \\/     M anipulation  |                                                 |                                   \

\*---------------------------------------------------------------------------*/
FoamFile {
    version 2.2;
    format ascii;
    class dictionary;
    object decomposeParDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //                                   \


method scotch;

numberOfSubdomains 16;

// ************************************************************************* // 
