system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
      {
        solver          GAMG;
        tolerance       1e-14;
        relTol          0.5;
        smoother        GaussSeidel;
        cacheAgglomeration true;
        nCellsInCoarsestLevel 10;
        agglomerator    faceAreaPair;
        mergeLevels     1;
      }

    pFinal
      {
        solver          GAMG;
        tolerance       1e-14;
        relTol          0.5;
        smoother        GaussSeidel;
        cacheAgglomeration true;
        nCellsInCoarsestLevel 10;
        agglomerator    faceAreaPair;
        mergeLevels     1;
      }

    "(U|k|epsilon)"
      {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-14;
        relTol          0.5;
      }

    "(U|k|epsilon)Final"
      {
        $U;
        tolerance       1e-14;
        relTol          0.5;
      }

    Csalt
      {
	solver PBiCG;
	preconditioner DILU;
	tolerance 1e-8;
	relTol 0;
      }

    Cpart1{solver PBiCG;preconditioner DILU;tolerance 1e-8;relTol 0;}
    Cpart1{solver PBiCG;preconditioner DILU;tolerance 1e-8;relTol 0;}
    Cpart1{solver PBiCG;preconditioner DILU;tolerance 1e-8;relTol 0;}
    Cpart1{solver PBiCG;preconditioner DILU;tolerance 1e-8;relTol 0;}
    Cpart1{solver PBiCG;preconditioner DILU;tolerance 1e-8;relTol 0;}

}

PIMPLE
{
  nOuterCorrectors 1;
  nCorrectors 2;
  nNonOrthogonalCorrectors 0;
  pRefCell 0;
  pRefValue 0;
}

PISO
{
    nCorrectors     2;
    nNonOrthogonalCorrectors 0;
    pRefCell        0;
    pRefValue       0;
}

SIMPLE
{
  nNonOrthogonalCorrectors 0;
  pRefCell        0;
  pRefValue       0;

    residualControl
      {
        p               1e-14;
        U               1e-14;
        nuTilda         1e-14;
      }
}

relaxationFactors
{
    fields
      {
        p               0.3;
      }
    equations
      {
        U               0.7;
        nuTilda         0.7;
      }
}

// ************************************************************************* //
